# Data Transformation
## Contents
1. Creating the Data

In [0]:
#Importing the library and removing the unwanted errors
import pandas as pd
import warnings
warnings.simplefilter('ignore')

## Creating the Data
* To understand the concepts we will work on small dataset. This time we will create our own data set.
* The simplest way to create dataset is to use list concept of python.
* Every list under the lsit wll represent every row & comma seperates the data column wise.
* Here we create two datasets:
 * GDP of countries.
 * Life expectancy of countries.
* We will then find answers to questions by analysing data.

In [12]:
#Creating GDP Dataset
table = [

['UK', 2678454886796.7], 

['USA', 16768100000000.0], 

['China', 9240270452047.0], 

['Brazil', 2245673032353.8],

['South Africa', 366057913367.1]

]
headings = ['country', 'GDP (US$)']
gdp = pd.DataFrame(columns=headings, data=table)
gdp

        country     GDP (US$)
0            UK  2.678455e+12
1           USA  1.676810e+13
2         China  9.240270e+12
3        Brazil  2.245673e+12
4  South Africa  3.660579e+11

In [13]:
headings = ['Country name', 'Life expectancy (years)']

table = [

['China', 75],

['Russia', 71],

['United States', 79],

['India', 66],

['United Kingdom', 81]

]
life_expectancy = pd.DataFrame(columns=headings, data=table)
life_expectancy

     Country name  Life expectancy (years)
0           China                       75
1          Russia                       71
2   United States                       79
3           India                       66
4  United Kingdom                       81

## Transforming Data
* We want to transform the GDP amount to the nearest millions to simplify the data readability.
* Therefore, we create function/method in python that will <b>round</b> the amount into nearest millions.
* If you dont want to return anything you can use: <pre>return None</pre>
* The built-in method <pre>round()</pre>rounds the value according to the BODMAS rules.
* We add one more method that expands the country names. 
for eg: USA-United States of America.

In [0]:
#User defined function that convertsamount to its nearest millions. 
def roundToMillions(value):
  result = round(value / 1000000)
  return result

In [0]:
#Function that abrrevates the acronym.
def expandCountry(name):
  if name == "USA":
    return "United States of America"
  elif name == "UK":
    return "United Kingdom"
  else:
    return name

In [0]:
#Convert the currency from US$ to UKpounds.
def ustoGbp(usd):
  pounds = usd/1.564768 #aerage rate in 2013
  return pounds

## Applying functions
* Lets look how we can use this functions for the columns in the dataset.
* We will use the function <pre>column.apply(<i>function_name</i>)</pre> to apply the user defined function to the particular column.

In [20]:
column = gdp['country'] #Assigning the column to the variable.
gdp['Country name'] = column.apply(expandCountry)
gdp

        country  ...              Country name
0            UK  ...            United Kingdom
1           USA  ...  United States of America
2         China  ...                     China
3        Brazil  ...                    Brazil
4  South Africa  ...              South Africa

[5 rows x 5 columns]

In [26]:
column = gdp['GDP (US$)']
gdp['GDP (pounds in Millions)'] = column.apply(ustoGbp).apply(roundToMillions)
gdp.drop(columns=['Country Name']) #removing the duplicacy as i changed the name

        country  ...              Country name
0            UK  ...            United Kingdom
1           USA  ...  United States of America
2         China  ...                     China
3        Brazil  ...                    Brazil
4  South Africa  ...              South Africa

[5 rows x 4 columns]

In [27]:
#Selecting the new columns to handle data with.
gdp_in_pounds = gdp[['Country name','GDP (pounds in Millions)']]
gdp_in_pounds

               Country name  GDP (pounds in Millions)
0            United Kingdom                   1711727
1  United States of America                  10716029
2                     China                   5905202
3                    Brazil                   1435148
4              South Africa                    233937

## Joining the tables
* Here both the tables have one common column <pre>Country name</pre>
* We <b>join</b> both the tables on the country name using the <pre>merge(<i>table_1, table_2, on=column_name, how=[left,] right, center])</i>)</pre>

In [31]:
#As we want all the columns of the left gdp_in_pounds table than we use join. 
pd.merge(gdp_in_pounds, life_expectancy, on='Country name', how='left')

               Country name  GDP (pounds in Millions)  Life expectancy (years)
0            United Kingdom                   1711727                     81.0
1  United States of America                  10716029                      NaN
2                     China                   5905202                     75.0
3                    Brazil                   1435148                      NaN
4              South Africa                    233937                      NaN

In [32]:
# To get all the combinations we use outer Joins
pd.merge(gdp_in_pounds, life_expectancy, on='Country name', how='outer')

               Country name  GDP (pounds in Millions)  Life expectancy (years)
0            United Kingdom                 1711727.0                     81.0
1  United States of America                10716029.0                      NaN
2                     China                 5905202.0                     75.0
3                    Brazil                 1435148.0                      NaN
4              South Africa                  233937.0                      NaN
5                    Russia                       NaN                     71.0
6             United States                       NaN                     79.0
7                     India                       NaN                     66.0